Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

Пример:

- 6 -> да
- 7 -> да
- 1 -> нет

num = int(input('Введите номер дня недели '))
if (7 < num or num <= 0):
    print ('Несуществующий день недели')
elif (1 <= num <= 5):
    print ('Рабочий день недели')
else:
    print ('Выходной день недели')

Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

Table = [
    [False,False,False],
    [False,False,True],
    [False,True,True],
    [True,True,True],
    [True,True,False],
    [True,False,False],
    [True,False,True],
    [False,True,False]
]
result = True
for i in Table:
    if not(not(i[0] or i[1] or i[2]))==(not i[0] and not i[1] and not i[2]):
        result=False
print(result)

Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

Пример:

- x=34; y=-30 -> 4
- x=2; y=4-> 1
- x=-34; y=-30 -> 3

X = int(input('Введите координату х '))
Y = int(input('Введите координату у '))
if (X > 0 and Y > 0):
    print ('1')
elif (X > 0 and Y < 0):
    print ('2')    
elif (X < 0 and Y < 0):
    print ('3')
else:
    print ('4')


Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

X = int(input('Введите номер четверти '))

if (X == 1):
    print ('X > 0 and Y > 0')
elif (X == 2):
    print ('X > 0 and Y < 0')    
elif (X == 3):
    print ('X < 0 and Y < 0')
elif (X == 4):
    print ('X < 0 and Y > 0')

Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

Пример:

- A (3,6); B (2,1) -> 5,09
- A (7,-5); B (1,-1) -> 7,21

Ax = int(input('введите координату Аx '))
Ay = int(input('введите координату Ay '))
Bx = int(input('введите координату Bx '))
By = int(input('введите координату Вy '))
AB = sqrt((Ax -Bx) ** 2 + (Ay -By) ** 2)
print(AB)  